##########################################################
#리스트에 요소 추가(append)
##append(x)는 리스트의 맨 마지막에 x를 추가하는 함수이다.


#리스트 정렬(sort)
##sort 함수는 리스트의 요소를 순서대로 정렬해 준다.


#리스트 뒤집기(reverse)
#reverse 함수는 리스트를 역순으로 뒤집어 준다


#인덱스 반환(index)
#index(x) 함수는 리스트에 x 값이 있으면 x의 인덱스 값을 리턴한다.


#리스트에 요소 삽입(insert)
#insert(a, b)는 리스트의 a번째 위치에 b를 삽입하는 함수이다


#리스트에 요소 제거(remove)
#remove(x)는 리스트에서 첫 번째로 나오는 x를 삭제하는 함수이다.


#리스트에 요소 끄집어내기(pop)
#pop()은 리스트의 맨 마지막 요소를 리턴하고 그 요소는 삭제한다.


#리스트에 포합된 요소 x의 개수 세기(count)
#count(x)는 리스트 안에 x가 몇 개 있는지 조사하여 그 개수를 리턴하는 함수이다.


#리스트 확장(extend)
#extend(x)에서 x에는 리스트만 올 수 있으며 원래의 a 리스트에 x 리스트를 더하게 된다.